src/Documents/ЭлектронноеПисьмо/ЭлектронноеПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмо</name>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вложения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЭлектронноеПисьмо/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура СоздатьПисьмо(Данные) Экспорт 
	
	Док = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	
	Док.Дата = ТекущаяДатаСеанса();
	Данные.Свойство("Получатели", Док.Получатели);
	Данные.Свойство("Тема", Док.Тема);
	Данные.Свойство("Тело", Док.Тело);
	
	Если Данные.Свойство("Вложения") Тогда
		Для Каждого Вложение Из Данные.Вложения Цикл
			НовСтр = Док.Вложения.Добавить();
			НовСтр.Ключ = Вложение.Ключ;
			НовСтр.Расширение = Вложение.Расширение;
			НовСтр.Значение = Новый ХранилищеЗначения(Вложение.Значение);
		КонецЦикла;	
	КонецЕсли;
	
	Док.Записать(РежимЗаписиДокумента.Запись);
		
КонецПроцедуры

#КонецОбласти
